Revit 2027 API
RebarShapeMultiplanarDefinition.OutOfPlaneBendDiameter Property
 Bend diameter to be applied to the connector segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OutOfPlaneBendDiameter { get; set; }
Public Property OutOfPlaneBendDiameter As Double
	Get
	Set
public:
property double OutOfPlaneBendDiameter {
	double get ();
	void set (double value);
}
member OutOfPlaneBendDiameter : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet.
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace